# Homebrew bundle for this dotfiles repo.
# Run from the repo root:  brew bundle install
#
# Before first Python/asdf build:  xcode-select --install
#
# Personal-only Mac: comment out the "Kraken / work" brew lines and work casks you
# do not need. Headless server: comment out GUI casks.

tap "nikitabobko/tap"

# --- GUI apps (comment out what you do not use) ---
cask "arc"
cask "cursor"
cask "aerospace"
cask "warp"
cask "postgres-unofficial"
cask "1password"
cask "slack"
cask "docker"
cask "font-fira-code"

# --- Core CLI + GPG (setup-gpg.sh can install gnupg too; listed here for one shot) ---
brew "asdf"
brew "direnv"
brew "starship"
brew "gnupg"
brew "pinentry-mac"

# --- Libraries for asdf Python / native builds ---
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"
brew "pkgconf"

# --- Kraken / work (comment out on personal Macs) ---
brew "kraken-cli"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "helm"
brew "aws-iam-authenticator"
brew "memcached"
brew "libmemcached"
brew "libxmlsec1"
brew "sops"
brew "codeowners"
brew "docker-credential-helper-ecr"
brew "watchexec"
brew "uv"

cask "1password-cli"
cask "claude"
cask "claude-code"
cask "gitkraken-cli"
